#include <iostream>
using namespace std;

/*------หลักการทำงานฟังก์ชัน greatDivisor-------

1. (line ) สร้่างฟังก์ชัน greatDivisor
2. เก็บตัวแปรใหม่ชื่อ i เอาค่า num-1 เพื่อให้เริ่มต้นน้่อยกว่าค่า num 
   ไม่อย่างนั้น num%num=0 ตั้งแต่แรกทำให้ได้ค่าที่ไม่ต้องการ
3. สร้างลูปเพื่อกำหนดว่า i ยังมากกว่า 0 อยู่ใช่มั้ย
4. สร้างเงื่อนไขใน while อีกทีนึง --> เงื่ิอนไข ถ้า num หาร i ลงตัว ให้ return(คืนค่า) i
5. นำ i ไปลบออก 1 เรื่อยๆ
6. return 1 เพราะว่าหากฟังก์ชัน greatDivisor ถูกนำไปใช้ต่อแล้วฟังก์ชันนี้ return ค่าออกมาเป็น 0 อาจะทำให้ค่าเพี้ยนหรือเกิดข้อผิดพลาดได้ 
   ตามหลักคณิตศาสตร์ return 1 สอดคล้องกับแนวคิดว่าทุกจำนวนเต็มบวกมีตัวหารเป็น 1 เสมอ
*/

int greatDivisor(int num){
    int i = num-1;
    while(i > 0){
        if(num%i == 0){
            return i;
        }
        i--;
    }
    return 1;
}

/*------หลักการทำงานฟังก์ชัน main-------
1. แสดงผลฟังก์ชัน greatDivisor ให้ค่า 91 ไป และนำไปทำงานในฟังก์ชัน จากนั้น return ค่าที่หาได้กลับมา
*/
int main(){
    cout << greatDivisor(91);
    return 0;
}