#include <iostream>
using namespace std;

/*------หลักการทำงานฟังก์ชัน findDivisor-------
1. สร้างฟังก์ชัน findDivisor
2. เก็บตัวแปรชื่อ i กำหนดค่าเป็นเพื่อให้เริ่มต้นที่ 1
3. สร้างลูปเพื่อกำหนดว่า ถ้า i น้อยกว่า num ใช่มั้ย
4. i เพิ่มขึ้นทีละ 1 ทุกครั้ง
5. สร้างเงื่อนไข while --> ถ้่า num หาร i ลงตัว ให้คืนค่า return(คืนค่า) i
ุ6. หากไม่ตรงเงื่อนไขใดเลย ให้ return 1 เพราะว่าหากฟังก์ชัน findDivisor ถูกนำไปใช้ต่อแล้วฟังก์ชันนี้ return ค่าออกมาเป็น 0 อาจะทำให้ค่าเพี้ยนหรือเกิดข้อผิดพลาดได้ 
   ตามหลักคณิตศาสตร์ return 1 สอดคล้องกับแนวคิดว่าทุกจำนวนเต็มบวกมีตัวหารเป็น 1 เสมอ


*/
int findDivisor(int num){
    int i = 1;
    while(i < num){
        i++;
        if(num%i == 0){
            return i;
        }
    }
    return 1;
}

/*------หลักการทำงานฟังก์ชัน main-------
1. แสดงผลฟังก์ชัน findDivisor ให้ค่า 97 ไป และนำไปทำงานในฟังก์ชัน จากนั้น return ค่าที่หาได้กลับมา
*/
int main(){
    cout << findDivisor(97);
    return 0;
}